프로젝트 초기 구성
